Revit 2027 API
AreaBasedLoadData Methods
The AreaBasedLoadData type exposes the following members.
Methods
Name | Description
AddElectricalLoadArea |  Adds electrical load area into the area based load.
CanConnectToUpstreamNode |  Verifies that the area based load can connect to the upstream electrical analytical node. If the area based load already has an upstream node or the upstream node is full of downstream nodes, the area based load can't connect to the upstream node.
CanDisconnectFromUpstreamNode |  Verifies that the area based load can disconnect from the upstream electrical analytical node. If the area based load hasn't an upstream node, it can't disconnect from the upstream node.
ConnectToUpstreamNode |  Connects to an upstream electrical analytical node.
DisconnectFromUpstreamNode |  Disconnects from an upstream electrical analytical node.
Dispose
(Inherited from ZoneElementDomainData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetElectricalLoadAreas |  Gets electrical load areas which the area based load includes.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetUpstreamNodeId |  Gets the upstream electrical analytical node id.
RemoveElectricalLoadArea |  Removes electrical load area from the area based load.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace